###############################################################
#  Generated by:      Cadence Encounter 10.12-s181_1
#  OS:                Linux x86_64(Host ID co2046-05.ece.iastate.edu)
#  Generated on:      Wed Oct  7 15:21:26 2015
#  Design:            lab1
#  Command:           optDesign -preCTS
###############################################################
set sdc_version 1.4
current_design lab1
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {iCLK}]  -name iCLK -period 0.8 -waveform {0 0.4}
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[3]}]
group_path -name I2O -from [get_ports {iSEL iRST_N iA1[3] iB0[4] iA1[5] iB0[6] iA1[7] iB1[1] iA0[1] iB1[3] iA0[3] iB1[5] iA0[5] iB1[7] iA0[7] iA1[0] iB0[1] iA1[2] iB0[3] iA1[4] iB0[5] iA1[6] iB0[7] iB1[0] iA0[0] iB1[2] iA0[2] iB1[4] iA0[4] iB1[6] iA0[6] iB0[0] iA1[1] iB0[2] iCLK}]  -to [get_ports {oR[0] oR[1] oR[2] oR[3] oR[4] oR[5] oR[6] oR[7] oR[8] oR[9] oR[10] oR[11] oR[12] oR[13] oR[14] oR[15] oR[16]}] 
group_path -name C2C -from [get_pins {{B1_reg[0]/CP} {B0_reg[5]/CP} {B0_reg[3]/CP} {B0_reg[2]/CP} {B1_reg[1]/CP} {oR_reg[10]/CP} {B0_reg[6]/CP} {B1_reg[5]/CP} {B1_reg[3]/CP} {B0_reg[7]/CP} {A1_reg[6]/CP} {A1_reg[3]/CP} {B1_reg[7]/CP} {A1_reg[7]/CP} {B0_reg[4]/CP} {A0_reg[0]/CP} {B1_reg[2]/CP} {A1_reg[0]/CP} {A0_reg[7]/CP} {A0_reg[3]/CP} {A0_reg[5]/CP} {A0_reg[1]/CP} {B0_reg[1]/CP} {B1_reg[6]/CP} {A1_reg[2]/CP} {A1_reg[1]/CP} {B1_reg[4]/CP} {A0_reg[2]/CP} {A1_reg[5]/CP} {B0_reg[0]/CP} {A1_reg[4]/CP} {A0_reg[6]/CP} {A0_reg[4]/CP} {oR_reg[0]/CP} {oR_reg[1]/CP} {oR_reg[2]/CP} {oR_reg[3]/CP} {oR_reg[4]/CP} {oR_reg[5]/CP} {oR_reg[6]/CP} {oR_reg[7]/CP} {oR_reg[8]/CP} {oR_reg[9]/CP} {oR_reg[11]/CP} {oR_reg[12]/CP} {oR_reg[13]/CP} {oR_reg[14]/CP} {oR_reg[15]/CP} {oR_reg[16]/CP}}]  -to [get_pins {{B1_reg[0]/D} {B0_reg[5]/D} {B0_reg[3]/D} {B0_reg[2]/D} {B1_reg[1]/D} {oR_reg[10]/D} {B0_reg[6]/D} {B1_reg[5]/D} {B1_reg[3]/D} {B0_reg[7]/D} {A1_reg[6]/D} {A1_reg[3]/D} {B1_reg[7]/D} {A1_reg[7]/D} {B0_reg[4]/D} {A0_reg[0]/D} {B1_reg[2]/D} {A1_reg[0]/D} {A0_reg[7]/D} {A0_reg[3]/D} {A0_reg[5]/D} {A0_reg[1]/D} {B0_reg[1]/D} {B1_reg[6]/D} {A1_reg[2]/D} {A1_reg[1]/D} {B1_reg[4]/D} {A0_reg[2]/D} {A1_reg[5]/D} {B0_reg[0]/D} {A1_reg[4]/D} {A0_reg[6]/D} {A0_reg[4]/D} {oR_reg[0]/CN} {oR_reg[0]/D} {oR_reg[1]/CN} {oR_reg[1]/D} {oR_reg[2]/CN} {oR_reg[2]/D} {oR_reg[3]/CN} {oR_reg[3]/D} {oR_reg[4]/CN} {oR_reg[4]/D} {oR_reg[5]/CN} {oR_reg[5]/D} {oR_reg[6]/CN} {oR_reg[6]/D} {oR_reg[7]/CN} {oR_reg[7]/D} {oR_reg[8]/CN} {oR_reg[8]/D} {oR_reg[9]/CN} {oR_reg[9]/D} {oR_reg[11]/CN} {oR_reg[11]/D} {oR_reg[12]/D} {oR_reg[13]/CN} {oR_reg[13]/D} {oR_reg[14]/D} {oR_reg[15]/CN} {oR_reg[15]/D} {oR_reg[16]/CN} {oR_reg[16]/D}}] 
group_path -name I2C -from [get_ports {iSEL iRST_N iA1[3] iB0[4] iA1[5] iB0[6] iA1[7] iB1[1] iA0[1] iB1[3] iA0[3] iB1[5] iA0[5] iB1[7] iA0[7] iA1[0] iB0[1] iA1[2] iB0[3] iA1[4] iB0[5] iA1[6] iB0[7] iB1[0] iA0[0] iB1[2] iA0[2] iB1[4] iA0[4] iB1[6] iA0[6] iB0[0] iA1[1] iB0[2] iCLK}]  -to [get_pins {{B1_reg[0]/D} {B0_reg[5]/D} {B0_reg[3]/D} {B0_reg[2]/D} {B1_reg[1]/D} {oR_reg[10]/D} {B0_reg[6]/D} {B1_reg[5]/D} {B1_reg[3]/D} {B0_reg[7]/D} {A1_reg[6]/D} {A1_reg[3]/D} {B1_reg[7]/D} {A1_reg[7]/D} {B0_reg[4]/D} {A0_reg[0]/D} {B1_reg[2]/D} {A1_reg[0]/D} {A0_reg[7]/D} {A0_reg[3]/D} {A0_reg[5]/D} {A0_reg[1]/D} {B0_reg[1]/D} {B1_reg[6]/D} {A1_reg[2]/D} {A1_reg[1]/D} {B1_reg[4]/D} {A0_reg[2]/D} {A1_reg[5]/D} {B0_reg[0]/D} {A1_reg[4]/D} {A0_reg[6]/D} {A0_reg[4]/D} {oR_reg[0]/CN} {oR_reg[0]/D} {oR_reg[1]/CN} {oR_reg[1]/D} {oR_reg[2]/CN} {oR_reg[2]/D} {oR_reg[3]/CN} {oR_reg[3]/D} {oR_reg[4]/CN} {oR_reg[4]/D} {oR_reg[5]/CN} {oR_reg[5]/D} {oR_reg[6]/CN} {oR_reg[6]/D} {oR_reg[7]/CN} {oR_reg[7]/D} {oR_reg[8]/CN} {oR_reg[8]/D} {oR_reg[9]/CN} {oR_reg[9]/D} {oR_reg[11]/CN} {oR_reg[11]/D} {oR_reg[12]/D} {oR_reg[13]/CN} {oR_reg[13]/D} {oR_reg[14]/D} {oR_reg[15]/CN} {oR_reg[15]/D} {oR_reg[16]/CN} {oR_reg[16]/D}}] 
group_path -name C2O -from [get_pins {{B1_reg[0]/CP} {B0_reg[5]/CP} {B0_reg[3]/CP} {B0_reg[2]/CP} {B1_reg[1]/CP} {oR_reg[10]/CP} {B0_reg[6]/CP} {B1_reg[5]/CP} {B1_reg[3]/CP} {B0_reg[7]/CP} {A1_reg[6]/CP} {A1_reg[3]/CP} {B1_reg[7]/CP} {A1_reg[7]/CP} {B0_reg[4]/CP} {A0_reg[0]/CP} {B1_reg[2]/CP} {A1_reg[0]/CP} {A0_reg[7]/CP} {A0_reg[3]/CP} {A0_reg[5]/CP} {A0_reg[1]/CP} {B0_reg[1]/CP} {B1_reg[6]/CP} {A1_reg[2]/CP} {A1_reg[1]/CP} {B1_reg[4]/CP} {A0_reg[2]/CP} {A1_reg[5]/CP} {B0_reg[0]/CP} {A1_reg[4]/CP} {A0_reg[6]/CP} {A0_reg[4]/CP} {oR_reg[0]/CP} {oR_reg[1]/CP} {oR_reg[2]/CP} {oR_reg[3]/CP} {oR_reg[4]/CP} {oR_reg[5]/CP} {oR_reg[6]/CP} {oR_reg[7]/CP} {oR_reg[8]/CP} {oR_reg[9]/CP} {oR_reg[11]/CP} {oR_reg[12]/CP} {oR_reg[13]/CP} {oR_reg[14]/CP} {oR_reg[15]/CP} {oR_reg[16]/CP}}]  -to [get_ports {oR[0] oR[1] oR[2] oR[3] oR[4] oR[5] oR[6] oR[7] oR[8] oR[9] oR[10] oR[11] oR[12] oR[13] oR[14] oR[15] oR[16]}] 
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL005}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLNQD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDFQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFFD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP16}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXOR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXNR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAN2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLHQD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GTIEL}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI22D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/INVD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GSDFCNQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOAI21D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI21D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKND24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR3D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BHD}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND3D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKBD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2ND1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP64}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/ANTENNA}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP16}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL02}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFTD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL0}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL01}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP64}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP10}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLNQD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP32}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDFCNQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFFD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXOR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAN2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXNR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLHQD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/INVD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GTIEH}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI21D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR3D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOAI21D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKND20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND3D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2ND2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKBD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP32}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL015}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFTD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP8}]
