###############################################################
#  Generated by:      Cadence Encounter 10.12-s181_1
#  OS:                Linux x86_64(Host ID co2046-05.ece.iastate.edu)
#  Generated on:      Wed Oct  7 16:13:44 2015
#  Design:            lab1
#  Command:           saveDesign lab6_4.enc
###############################################################
set sdc_version 1.4
current_design lab1
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {iCLK}]  -name iCLK -period 0.8 -waveform {0 0.4}
set_propagated_clock  [get_ports {iCLK}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA0[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB1[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iB0[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {iCLK}] [get_ports {iA1[3]}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDFQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLNQD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKBD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR3D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2ND1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP10}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND3D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXOR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXNR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAN2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI21D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GTIEH}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFTD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLHQD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOAI21D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP16}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL015}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BHD}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL005}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP32}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFFD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/INVD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKND20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDFCNQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLNQD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKBD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2ND2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOAI21D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR3D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXOR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND3D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXNR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI22D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GTIEL}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAN2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL0}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFTD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI21D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GSDFCNQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP64}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLHQD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP32}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL02}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/ANTENNA}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL01}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP64}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP16}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFFD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/INVD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKND24}]
