###############################################################
#  Generated by:      Cadence Encounter 10.12-s181_1
#  OS:                Linux x86_64(Host ID co1313-03.ece.iastate.edu)
#  Generated on:      Wed Dec 17 18:57:32 2014
#  Design:            GCC
#  Command:           saveDesign GCC.enc
###############################################################
set sdc_version 1.4
current_design GCC
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {CLK}]  -name CLK -period 3.2 -waveform {0 1.6}
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[5]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {W[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {W[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[6]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {W[3]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[4]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {W[1]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[2]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {Y[0]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[7]}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {CLK}] [get_ports {X[5]}]
group_path -name cg_enable_group_CLK -through [get_pins {RC_CG_HIER_INST6/enable RC_CG_HIER_INST5/enable RC_CG_HIER_INST4/enable RC_CG_HIER_INST3/enable RC_CG_HIER_INST2/enable RC_CG_HIER_INST1/enable RC_CG_HIER_INST0/enable}] 
group_path -name I2C -from [get_ports {W[0] W[1] W[2] W[3] Y[0] Y[1] Y[2] Y[3] Y[4] Y[5] Y[6] Y[7] X[0] X[1] X[2] X[3] X[4] X[5] X[6] X[7] RESET CLK}]  -to [get_pins {{x_reg[5][2]/D} {y_reg[5][2]/D} {i_reg[0]/CN} {i_reg[0]/D} {i_reg[2]/CN} {i_reg[2]/D} {y_reg[5][7]/D} {y_reg[2][5]/D} {x_reg[1][1]/D} {y_reg[2][4]/D} {x_reg[0][6]/D} {x_reg[4][6]/D} {x_reg[1][7]/D} {y_reg[4][7]/D} {x_reg[1][0]/D} {y_reg[3][7]/D} {x_reg[3][6]/D} {Ycc_reg[5]/D} {Xcc_reg[5]/D} {y_reg[5][5]/D} {y_reg[5][1]/D} {y_reg[4][5]/D} {y_reg[2][7]/D} {y_reg[2][2]/D} {y_reg[1][7]/D} {y_reg[1][4]/D} {y_reg[1][2]/D} {y_reg[0][7]/D} {y_reg[0][5]/D} {x_reg[5][7]/D} {x_reg[5][6]/D} {x_reg[4][7]/D} {x_reg[4][3]/D} {x_reg[4][0]/D} {x_reg[3][7]/D} {x_reg[3][5]/D} {x_reg[3][2]/D} {x_reg[3][0]/D} {x_reg[2][1]/D} {x_reg[1][5]/D} {x_reg[1][2]/D} {Ycc_reg[6]/D} {Ycc_reg[3]/D} {Ycc_reg[1]/D} {Ycc_reg[0]/D} {Xcc_reg[7]/D} {Xcc_reg[0]/D} {i_reg[1]/CN} {i_reg[1]/D} {y_reg[5][6]/D} {y_reg[5][4]/D} {y_reg[5][3]/D} {y_reg[5][0]/D} {y_reg[4][6]/D} {y_reg[4][4]/D} {y_reg[4][3]/D} {y_reg[4][2]/D} {y_reg[4][1]/D} {y_reg[4][0]/D} {y_reg[3][6]/D} {y_reg[3][5]/D} {y_reg[3][4]/D} {y_reg[3][3]/D} {y_reg[3][2]/D} {y_reg[3][1]/D} {y_reg[3][0]/D} {y_reg[2][6]/D} {y_reg[2][3]/D} {y_reg[2][1]/D} {y_reg[2][0]/D} {y_reg[1][6]/D} {y_reg[1][5]/D} {y_reg[1][3]/D} {y_reg[1][1]/D} {y_reg[1][0]/D} {y_reg[0][6]/D} {y_reg[0][4]/D} {y_reg[0][3]/D} {y_reg[0][2]/D} {y_reg[0][1]/D} {y_reg[0][0]/D} {x_reg[5][5]/D} {x_reg[5][4]/D} {x_reg[5][3]/D} {x_reg[5][1]/D} {x_reg[5][0]/D} {x_reg[4][5]/D} {x_reg[4][4]/D} {x_reg[4][2]/D} {x_reg[4][1]/D} {x_reg[3][4]/D} {x_reg[3][3]/D} {x_reg[3][1]/D} {x_reg[2][7]/D} {x_reg[2][6]/D} {x_reg[2][5]/D} {x_reg[2][4]/D} {x_reg[2][3]/D} {x_reg[2][2]/D} {x_reg[2][0]/D} {x_reg[1][6]/D} {x_reg[1][4]/D} {x_reg[1][3]/D} {x_reg[0][7]/D} {x_reg[0][5]/D} {x_reg[0][4]/D} {x_reg[0][3]/D} {x_reg[0][2]/D} {x_reg[0][1]/D} {x_reg[0][0]/D} {w_reg[5][3]/D} {w_reg[5][2]/D} {w_reg[5][1]/D} {w_reg[5][0]/D} {w_reg[4][3]/D} {w_reg[4][2]/D} {w_reg[4][1]/D} {w_reg[4][0]/D} {w_reg[3][3]/D} {w_reg[3][2]/D} {w_reg[3][1]/D} {w_reg[3][0]/D} {w_reg[2][3]/D} {w_reg[2][2]/D} {w_reg[2][1]/D} {w_reg[2][0]/D} {w_reg[1][3]/D} {w_reg[1][2]/D} {w_reg[1][1]/D} {w_reg[1][0]/D} {w_reg[0][3]/D} {w_reg[0][2]/D} {w_reg[0][1]/D} {w_reg[0][0]/D} {Ycc_reg[7]/D} {Ycc_reg[4]/D} {Ycc_reg[2]/D} {Xcc_reg[6]/D} {Xcc_reg[4]/D} {Xcc_reg[3]/D} {Xcc_reg[2]/D} {Xcc_reg[1]/D} {Compare45/max_reg[0]/D} {compare01/max_reg[0]/D} {Compare23/max_reg[0]/D} {Compare0123/max_reg[1]/D} {Compare0123/max_reg[0]/D} {CompareAll/max_reg[2]/D} {CompareAll/max_reg[1]/D} {CompareAll/max_reg[0]/D} RC_CG_HIER_INST6/RC_CGIC_INST/QD RC_CG_HIER_INST6/RC_CGIC_INST/E RC_CG_HIER_INST6/RC_CGIC_INST/TE RC_CG_HIER_INST5/RC_CGIC_INST/QD RC_CG_HIER_INST5/RC_CGIC_INST/E RC_CG_HIER_INST5/RC_CGIC_INST/TE RC_CG_HIER_INST4/RC_CGIC_INST/QD RC_CG_HIER_INST4/RC_CGIC_INST/E RC_CG_HIER_INST4/RC_CGIC_INST/TE RC_CG_HIER_INST3/RC_CGIC_INST/QD RC_CG_HIER_INST3/RC_CGIC_INST/E RC_CG_HIER_INST3/RC_CGIC_INST/TE RC_CG_HIER_INST2/RC_CGIC_INST/QD RC_CG_HIER_INST2/RC_CGIC_INST/E RC_CG_HIER_INST2/RC_CGIC_INST/TE RC_CG_HIER_INST1/RC_CGIC_INST/QD RC_CG_HIER_INST1/RC_CGIC_INST/E RC_CG_HIER_INST1/RC_CGIC_INST/TE RC_CG_HIER_INST0/RC_CGIC_INST/QD RC_CG_HIER_INST0/RC_CGIC_INST/E RC_CG_HIER_INST0/RC_CGIC_INST/TE}] 
group_path -name C2C -from [get_pins {{x_reg[5][2]/CP} {y_reg[5][2]/CP} {i_reg[0]/CP} {i_reg[2]/CP} {y_reg[5][7]/CP} {y_reg[2][5]/CP} {x_reg[1][1]/CP} {y_reg[2][4]/CP} {x_reg[0][6]/CP} {x_reg[4][6]/CP} {x_reg[1][7]/CP} {y_reg[4][7]/CP} {x_reg[1][0]/CP} {y_reg[3][7]/CP} {x_reg[3][6]/CP} {Ycc_reg[5]/CP} {Xcc_reg[5]/CP} {y_reg[5][5]/CP} {y_reg[5][1]/CP} {y_reg[4][5]/CP} {y_reg[2][7]/CP} {y_reg[2][2]/CP} {y_reg[1][7]/CP} {y_reg[1][4]/CP} {y_reg[1][2]/CP} {y_reg[0][7]/CP} {y_reg[0][5]/CP} {x_reg[5][7]/CP} {x_reg[5][6]/CP} {x_reg[4][7]/CP} {x_reg[4][3]/CP} {x_reg[4][0]/CP} {x_reg[3][7]/CP} {x_reg[3][5]/CP} {x_reg[3][2]/CP} {x_reg[3][0]/CP} {x_reg[2][1]/CP} {x_reg[1][5]/CP} {x_reg[1][2]/CP} {Ycc_reg[6]/CP} {Ycc_reg[3]/CP} {Ycc_reg[1]/CP} {Ycc_reg[0]/CP} {Xcc_reg[7]/CP} {Xcc_reg[0]/CP} {i_reg[1]/CP} {y_reg[5][6]/CP} {y_reg[5][4]/CP} {y_reg[5][3]/CP} {y_reg[5][0]/CP} {y_reg[4][6]/CP} {y_reg[4][4]/CP} {y_reg[4][3]/CP} {y_reg[4][2]/CP} {y_reg[4][1]/CP} {y_reg[4][0]/CP} {y_reg[3][6]/CP} {y_reg[3][5]/CP} {y_reg[3][4]/CP} {y_reg[3][3]/CP} {y_reg[3][2]/CP} {y_reg[3][1]/CP} {y_reg[3][0]/CP} {y_reg[2][6]/CP} {y_reg[2][3]/CP} {y_reg[2][1]/CP} {y_reg[2][0]/CP} {y_reg[1][6]/CP} {y_reg[1][5]/CP} {y_reg[1][3]/CP} {y_reg[1][1]/CP} {y_reg[1][0]/CP} {y_reg[0][6]/CP} {y_reg[0][4]/CP} {y_reg[0][3]/CP} {y_reg[0][2]/CP} {y_reg[0][1]/CP} {y_reg[0][0]/CP} {x_reg[5][5]/CP} {x_reg[5][4]/CP} {x_reg[5][3]/CP} {x_reg[5][1]/CP} {x_reg[5][0]/CP} {x_reg[4][5]/CP} {x_reg[4][4]/CP} {x_reg[4][2]/CP} {x_reg[4][1]/CP} {x_reg[3][4]/CP} {x_reg[3][3]/CP} {x_reg[3][1]/CP} {x_reg[2][7]/CP} {x_reg[2][6]/CP} {x_reg[2][5]/CP} {x_reg[2][4]/CP} {x_reg[2][3]/CP} {x_reg[2][2]/CP} {x_reg[2][0]/CP} {x_reg[1][6]/CP} {x_reg[1][4]/CP} {x_reg[1][3]/CP} {x_reg[0][7]/CP} {x_reg[0][5]/CP} {x_reg[0][4]/CP} {x_reg[0][3]/CP} {x_reg[0][2]/CP} {x_reg[0][1]/CP} {x_reg[0][0]/CP} {w_reg[5][3]/CP} {w_reg[5][2]/CP} {w_reg[5][1]/CP} {w_reg[5][0]/CP} {w_reg[4][3]/CP} {w_reg[4][2]/CP} {w_reg[4][1]/CP} {w_reg[4][0]/CP} {w_reg[3][3]/CP} {w_reg[3][2]/CP} {w_reg[3][1]/CP} {w_reg[3][0]/CP} {w_reg[2][3]/CP} {w_reg[2][2]/CP} {w_reg[2][1]/CP} {w_reg[2][0]/CP} {w_reg[1][3]/CP} {w_reg[1][2]/CP} {w_reg[1][1]/CP} {w_reg[1][0]/CP} {w_reg[0][3]/CP} {w_reg[0][2]/CP} {w_reg[0][1]/CP} {w_reg[0][0]/CP} {Ycc_reg[7]/CP} {Ycc_reg[4]/CP} {Ycc_reg[2]/CP} {Xcc_reg[6]/CP} {Xcc_reg[4]/CP} {Xcc_reg[3]/CP} {Xcc_reg[2]/CP} {Xcc_reg[1]/CP} {Compare45/max_reg[0]/EN} {compare01/max_reg[0]/E} {Compare23/max_reg[0]/E} {Compare0123/max_reg[1]/E} {Compare0123/max_reg[0]/E} {CompareAll/max_reg[2]/EN} {CompareAll/max_reg[1]/EN} {CompareAll/max_reg[0]/EN} RC_CG_HIER_INST6/RC_CGIC_INST/CP RC_CG_HIER_INST5/RC_CGIC_INST/CP RC_CG_HIER_INST4/RC_CGIC_INST/CP RC_CG_HIER_INST3/RC_CGIC_INST/CP RC_CG_HIER_INST2/RC_CGIC_INST/CP RC_CG_HIER_INST1/RC_CGIC_INST/CP RC_CG_HIER_INST0/RC_CGIC_INST/CP}]  -to [get_pins {{x_reg[5][2]/D} {y_reg[5][2]/D} {i_reg[0]/CN} {i_reg[0]/D} {i_reg[2]/CN} {i_reg[2]/D} {y_reg[5][7]/D} {y_reg[2][5]/D} {x_reg[1][1]/D} {y_reg[2][4]/D} {x_reg[0][6]/D} {x_reg[4][6]/D} {x_reg[1][7]/D} {y_reg[4][7]/D} {x_reg[1][0]/D} {y_reg[3][7]/D} {x_reg[3][6]/D} {Ycc_reg[5]/D} {Xcc_reg[5]/D} {y_reg[5][5]/D} {y_reg[5][1]/D} {y_reg[4][5]/D} {y_reg[2][7]/D} {y_reg[2][2]/D} {y_reg[1][7]/D} {y_reg[1][4]/D} {y_reg[1][2]/D} {y_reg[0][7]/D} {y_reg[0][5]/D} {x_reg[5][7]/D} {x_reg[5][6]/D} {x_reg[4][7]/D} {x_reg[4][3]/D} {x_reg[4][0]/D} {x_reg[3][7]/D} {x_reg[3][5]/D} {x_reg[3][2]/D} {x_reg[3][0]/D} {x_reg[2][1]/D} {x_reg[1][5]/D} {x_reg[1][2]/D} {Ycc_reg[6]/D} {Ycc_reg[3]/D} {Ycc_reg[1]/D} {Ycc_reg[0]/D} {Xcc_reg[7]/D} {Xcc_reg[0]/D} {i_reg[1]/CN} {i_reg[1]/D} {y_reg[5][6]/D} {y_reg[5][4]/D} {y_reg[5][3]/D} {y_reg[5][0]/D} {y_reg[4][6]/D} {y_reg[4][4]/D} {y_reg[4][3]/D} {y_reg[4][2]/D} {y_reg[4][1]/D} {y_reg[4][0]/D} {y_reg[3][6]/D} {y_reg[3][5]/D} {y_reg[3][4]/D} {y_reg[3][3]/D} {y_reg[3][2]/D} {y_reg[3][1]/D} {y_reg[3][0]/D} {y_reg[2][6]/D} {y_reg[2][3]/D} {y_reg[2][1]/D} {y_reg[2][0]/D} {y_reg[1][6]/D} {y_reg[1][5]/D} {y_reg[1][3]/D} {y_reg[1][1]/D} {y_reg[1][0]/D} {y_reg[0][6]/D} {y_reg[0][4]/D} {y_reg[0][3]/D} {y_reg[0][2]/D} {y_reg[0][1]/D} {y_reg[0][0]/D} {x_reg[5][5]/D} {x_reg[5][4]/D} {x_reg[5][3]/D} {x_reg[5][1]/D} {x_reg[5][0]/D} {x_reg[4][5]/D} {x_reg[4][4]/D} {x_reg[4][2]/D} {x_reg[4][1]/D} {x_reg[3][4]/D} {x_reg[3][3]/D} {x_reg[3][1]/D} {x_reg[2][7]/D} {x_reg[2][6]/D} {x_reg[2][5]/D} {x_reg[2][4]/D} {x_reg[2][3]/D} {x_reg[2][2]/D} {x_reg[2][0]/D} {x_reg[1][6]/D} {x_reg[1][4]/D} {x_reg[1][3]/D} {x_reg[0][7]/D} {x_reg[0][5]/D} {x_reg[0][4]/D} {x_reg[0][3]/D} {x_reg[0][2]/D} {x_reg[0][1]/D} {x_reg[0][0]/D} {w_reg[5][3]/D} {w_reg[5][2]/D} {w_reg[5][1]/D} {w_reg[5][0]/D} {w_reg[4][3]/D} {w_reg[4][2]/D} {w_reg[4][1]/D} {w_reg[4][0]/D} {w_reg[3][3]/D} {w_reg[3][2]/D} {w_reg[3][1]/D} {w_reg[3][0]/D} {w_reg[2][3]/D} {w_reg[2][2]/D} {w_reg[2][1]/D} {w_reg[2][0]/D} {w_reg[1][3]/D} {w_reg[1][2]/D} {w_reg[1][1]/D} {w_reg[1][0]/D} {w_reg[0][3]/D} {w_reg[0][2]/D} {w_reg[0][1]/D} {w_reg[0][0]/D} {Ycc_reg[7]/D} {Ycc_reg[4]/D} {Ycc_reg[2]/D} {Xcc_reg[6]/D} {Xcc_reg[4]/D} {Xcc_reg[3]/D} {Xcc_reg[2]/D} {Xcc_reg[1]/D} {Compare45/max_reg[0]/D} {compare01/max_reg[0]/D} {Compare23/max_reg[0]/D} {Compare0123/max_reg[1]/D} {Compare0123/max_reg[0]/D} {CompareAll/max_reg[2]/D} {CompareAll/max_reg[1]/D} {CompareAll/max_reg[0]/D} RC_CG_HIER_INST6/RC_CGIC_INST/QD RC_CG_HIER_INST6/RC_CGIC_INST/E RC_CG_HIER_INST6/RC_CGIC_INST/TE RC_CG_HIER_INST5/RC_CGIC_INST/QD RC_CG_HIER_INST5/RC_CGIC_INST/E RC_CG_HIER_INST5/RC_CGIC_INST/TE RC_CG_HIER_INST4/RC_CGIC_INST/QD RC_CG_HIER_INST4/RC_CGIC_INST/E RC_CG_HIER_INST4/RC_CGIC_INST/TE RC_CG_HIER_INST3/RC_CGIC_INST/QD RC_CG_HIER_INST3/RC_CGIC_INST/E RC_CG_HIER_INST3/RC_CGIC_INST/TE RC_CG_HIER_INST2/RC_CGIC_INST/QD RC_CG_HIER_INST2/RC_CGIC_INST/E RC_CG_HIER_INST2/RC_CGIC_INST/TE RC_CG_HIER_INST1/RC_CGIC_INST/QD RC_CG_HIER_INST1/RC_CGIC_INST/E RC_CG_HIER_INST1/RC_CGIC_INST/TE RC_CG_HIER_INST0/RC_CGIC_INST/QD RC_CG_HIER_INST0/RC_CGIC_INST/E RC_CG_HIER_INST0/RC_CGIC_INST/TE}] 
group_path -name C2O -from [get_pins {{x_reg[5][2]/CP} {y_reg[5][2]/CP} {i_reg[0]/CP} {i_reg[2]/CP} {y_reg[5][7]/CP} {y_reg[2][5]/CP} {x_reg[1][1]/CP} {y_reg[2][4]/CP} {x_reg[0][6]/CP} {x_reg[4][6]/CP} {x_reg[1][7]/CP} {y_reg[4][7]/CP} {x_reg[1][0]/CP} {y_reg[3][7]/CP} {x_reg[3][6]/CP} {Ycc_reg[5]/CP} {Xcc_reg[5]/CP} {y_reg[5][5]/CP} {y_reg[5][1]/CP} {y_reg[4][5]/CP} {y_reg[2][7]/CP} {y_reg[2][2]/CP} {y_reg[1][7]/CP} {y_reg[1][4]/CP} {y_reg[1][2]/CP} {y_reg[0][7]/CP} {y_reg[0][5]/CP} {x_reg[5][7]/CP} {x_reg[5][6]/CP} {x_reg[4][7]/CP} {x_reg[4][3]/CP} {x_reg[4][0]/CP} {x_reg[3][7]/CP} {x_reg[3][5]/CP} {x_reg[3][2]/CP} {x_reg[3][0]/CP} {x_reg[2][1]/CP} {x_reg[1][5]/CP} {x_reg[1][2]/CP} {Ycc_reg[6]/CP} {Ycc_reg[3]/CP} {Ycc_reg[1]/CP} {Ycc_reg[0]/CP} {Xcc_reg[7]/CP} {Xcc_reg[0]/CP} {i_reg[1]/CP} {y_reg[5][6]/CP} {y_reg[5][4]/CP} {y_reg[5][3]/CP} {y_reg[5][0]/CP} {y_reg[4][6]/CP} {y_reg[4][4]/CP} {y_reg[4][3]/CP} {y_reg[4][2]/CP} {y_reg[4][1]/CP} {y_reg[4][0]/CP} {y_reg[3][6]/CP} {y_reg[3][5]/CP} {y_reg[3][4]/CP} {y_reg[3][3]/CP} {y_reg[3][2]/CP} {y_reg[3][1]/CP} {y_reg[3][0]/CP} {y_reg[2][6]/CP} {y_reg[2][3]/CP} {y_reg[2][1]/CP} {y_reg[2][0]/CP} {y_reg[1][6]/CP} {y_reg[1][5]/CP} {y_reg[1][3]/CP} {y_reg[1][1]/CP} {y_reg[1][0]/CP} {y_reg[0][6]/CP} {y_reg[0][4]/CP} {y_reg[0][3]/CP} {y_reg[0][2]/CP} {y_reg[0][1]/CP} {y_reg[0][0]/CP} {x_reg[5][5]/CP} {x_reg[5][4]/CP} {x_reg[5][3]/CP} {x_reg[5][1]/CP} {x_reg[5][0]/CP} {x_reg[4][5]/CP} {x_reg[4][4]/CP} {x_reg[4][2]/CP} {x_reg[4][1]/CP} {x_reg[3][4]/CP} {x_reg[3][3]/CP} {x_reg[3][1]/CP} {x_reg[2][7]/CP} {x_reg[2][6]/CP} {x_reg[2][5]/CP} {x_reg[2][4]/CP} {x_reg[2][3]/CP} {x_reg[2][2]/CP} {x_reg[2][0]/CP} {x_reg[1][6]/CP} {x_reg[1][4]/CP} {x_reg[1][3]/CP} {x_reg[0][7]/CP} {x_reg[0][5]/CP} {x_reg[0][4]/CP} {x_reg[0][3]/CP} {x_reg[0][2]/CP} {x_reg[0][1]/CP} {x_reg[0][0]/CP} {w_reg[5][3]/CP} {w_reg[5][2]/CP} {w_reg[5][1]/CP} {w_reg[5][0]/CP} {w_reg[4][3]/CP} {w_reg[4][2]/CP} {w_reg[4][1]/CP} {w_reg[4][0]/CP} {w_reg[3][3]/CP} {w_reg[3][2]/CP} {w_reg[3][1]/CP} {w_reg[3][0]/CP} {w_reg[2][3]/CP} {w_reg[2][2]/CP} {w_reg[2][1]/CP} {w_reg[2][0]/CP} {w_reg[1][3]/CP} {w_reg[1][2]/CP} {w_reg[1][1]/CP} {w_reg[1][0]/CP} {w_reg[0][3]/CP} {w_reg[0][2]/CP} {w_reg[0][1]/CP} {w_reg[0][0]/CP} {Ycc_reg[7]/CP} {Ycc_reg[4]/CP} {Ycc_reg[2]/CP} {Xcc_reg[6]/CP} {Xcc_reg[4]/CP} {Xcc_reg[3]/CP} {Xcc_reg[2]/CP} {Xcc_reg[1]/CP} {Compare45/max_reg[0]/EN} {compare01/max_reg[0]/E} {Compare23/max_reg[0]/E} {Compare0123/max_reg[1]/E} {Compare0123/max_reg[0]/E} {CompareAll/max_reg[2]/EN} {CompareAll/max_reg[1]/EN} {CompareAll/max_reg[0]/EN} RC_CG_HIER_INST6/RC_CGIC_INST/CP RC_CG_HIER_INST5/RC_CGIC_INST/CP RC_CG_HIER_INST4/RC_CGIC_INST/CP RC_CG_HIER_INST3/RC_CGIC_INST/CP RC_CG_HIER_INST2/RC_CGIC_INST/CP RC_CG_HIER_INST1/RC_CGIC_INST/CP RC_CG_HIER_INST0/RC_CGIC_INST/CP}]  -to [get_ports {Yc[0] Yc[1] Yc[2] Yc[3] Yc[4] Yc[5] Yc[6] Yc[7] Xc[0] Xc[1] Xc[2] Xc[3] Xc[4] Xc[5] Xc[6] Xc[7] READY}] 
group_path -name I2O -from [get_ports {W[0] W[1] W[2] W[3] Y[0] Y[1] Y[2] Y[3] Y[4] Y[5] Y[6] Y[7] X[0] X[1] X[2] X[3] X[4] X[5] X[6] X[7] RESET CLK}]  -to [get_ports {Yc[0] Yc[1] Yc[2] Yc[3] Yc[4] Yc[5] Yc[6] Yc[7] Xc[0] Xc[1] Xc[2] Xc[3] Xc[4] Xc[5] Xc[6] Xc[7] READY}] 
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXNR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI22D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFTD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLHQD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP32}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLNQD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKND20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2ND1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND3D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GTIEL}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOAI21D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI21D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKBD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL02}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP64}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GSDFCNQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR3D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAN2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFFD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/ANTENNA}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/INVD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/FA1D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL01}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDFCNQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP32}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BHD}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXOR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLHQD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/FA1D0}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL0}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP64}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKLNQD24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKND24}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2ND2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND3D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXNR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOR2D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAOI21D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFTD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/OD18DCAP16}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP10}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GMUX2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GTIEH}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOAI21D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GAN2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/CKBD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/FA1D4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL015}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDFQD1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GINVD8}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D3}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GOR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GXOR2D2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GNR3D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GBUFFD2}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/BUFFD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/INVD20}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/FA1D1}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL005}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DEL4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GDCAP4}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/DCAP16}]
set_dont_use  [get_lib_cells {tcbn65gpluswc/GND2D1}]
